export class Weather{
     hello() {
        console.log('hello~')
    }
}

export const Reason = ['01違規超車', '02爭(搶)道行駛', '03蛇行、方向不定', '04逆向行駛', '05未靠右行駛', '06未依規定讓車', '07變換車道或方向不當', '08左轉彎未依規定', '09右轉彎未依規定', '10迴轉未依規定', '11橫越道路不慎', '12倒車未依規定', '13超速失控', '14未依規定減速', '15搶越行人穿越道', '16未保持行車安全距離', '17未保持行車安全間隔', '18停車操作時，未注意其他車', '19起步未注意其他車(人)安全', '20吸食違禁物後駕駛失控', '21酒醉(後)駕駛失控', '22疲勞(患病)駕駛失控', '23未注意車前狀態', '24搶(闖)越平交道', '25違反號誌管制或指揮', '26違反特定標誌(線)禁制燈光', '27未依規定使用燈光', '28暗處停車無燈光、標識', '29夜間行駛無燈光設備', '30裝載貨物不穩妥', '31載貨超重而失控', '32超載人員而失控', '33貨物超長、寬、高而肇事', '34裝卸貨不當', '35裝載未盡安全措施', '36未待乘客安全上下開車', '37其他裝載不當肇事', '38違規停車或暫停不當而肇事', '39拋錨未採安全措施', '40開啟車門不當而肇事', '41使用手持行動電話失控', '42其他引起事故之違規或不當行為', '43不明原因肇事', '44尚未發現肇事因素', '45煞車失靈', '46方向操縱系統故障', '47燈光系統故障', '48車輪脫落或輪胎爆裂', '49車輛零件脫落', '50其他引起事故之故障', '51未依規定行走行人穿越道、地下道、天橋而穿越道路', '52未依標誌、標線、號誌或手勢指揮穿越道路', '53穿越道路未注意左右來車', '54在道路上嬉戲或奔走不定', '55未待車輛停妥而上下車', '56上下車輛未注意安全', '57頭手伸出車外而肇事', '58乘坐不當而跌落', '59在路上工作未設適當標識', '60其他引起事故之疏失或行為', '61路況危險無安全(警告)設施', '62交通管制設施失靈或損毀', '63交通指揮不當', '64平交道看守疏失或未放柵欄', '65其他交通管制不當', '66動物竄出', '67尚未發現肇事因素']

export const Type = ['01對向通行中', '02同向通行中', '03穿越道路中', '04在路上嬉戲', '05在路上作業中', '06衝進路中', '07停車後穿出', '08佇立路邊', '09其他', '10對撞', '11對向擦撞', '12同向擦撞', '13追撞', '14倒車撞', '15路口交岔撞', '16側撞', '17其他', '18路上翻車、摔倒', '19衝出路外', '20撞護欄', '21撞號誌、標誌桿', '22撞收費亭', '23撞交通島', '24撞非固定設施', '25撞橋樑、建築物', '26撞路樹、電桿', '27撞動物', '28撞工程施工', '29其他', '30衝過遮斷器', '31正越過平交道中', '32暫停位置不當', '33在平交道內無法行動', '34其他', '35?']
